blog/2011/06/09/configuring-apache-+-fcgid_module/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>配置Apache+fcgid_module - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>配置Apache+fcgid_module</h1>
  <p>
请先看<a href="http://roygu.com/2011/03/php/php-vc9-or-vc6-thread_safe-or-non_thread_safe.html">VC9,VC6,Thread Safe,Non Thread Safe的意思?</a>。 PHP有两种执行方式：ISAPI 和 FastCGI。
</p>





<p>
ISAPI 执行方式是以 DLL 动态库的形式使用，可以在被用户请求后执行，在处理完一个用户请求后不会马上消失，所以需要进行线程安全检查，这样来提高程序的执行效率，所以如果是以 ISAPI 来执行 PHP，建议选择 Thread Safe 版本；
</p>





<p>
而 FastCGI 执行方式是以单一线程来执行操作，所以不需要进行线程的安全检查，除去线程安全检查的防护反而可以提高执行效率，所以，如果是以 FastCGI 来执行 PHP，建议选择 Non Thread Safe 版本。
</p>





<p>
FastCGI 又有fastcgi和fcgid两个模块，推荐使用fcgid，在apache项目的页面上有单独的链接页面。配置信息如下：
</p>





<pre class="example">
LoadModule fcgid_module modules/mod_fcgid.so

&lt;IfModule fcgid_module&gt;
   FcgidInitialEnv PHPRC "c:/php/"
   FcgidInitialEnv PATH "C:/php;C:/WINDOWS/system32;C:/WINDOWS;C:/WINDOWS/System32/Wbem;"
   FcgidInitialEnv SystemRoot "C:/Windows"
   FcgidInitialEnv SystemDrive "C:"
   FcgidInitialEnv TEMP "C:/WINDOWS/TEMP"
   FcgidInitialEnv TMP "C:/WINDOWS/TEMP"
   FcgidInitialEnv windir "C:/WINDOWS"

   FcgidIOTimeout 40
   FcgidConnectTimeout 10
   FcgidMaxProcesses 1000
   FcgidOutputBufferSize 64
   FcgidProcessLifeTime 120
   FcgidMaxRequestsPerProcess 10000
   FcgidMinProcessesPerClass 0
   FcgidFixPathinfo 1

# Global Config Example
  &lt;Files ~ "\.php$"&gt;

    Options Indexes FollowSymLinks ExecCGI
    AddHandler fcgid-script .php
    FcgidWrapper "c:/php/php-cgi.exe" .php
  &lt;/Files&gt;
&lt;/IfModule&gt;
</pre>





<p>
现在官方都不推荐使用VC6版本了，也不会提供VC6的源码，所以大家都迁移到PHP VC9。这里推荐几个网站，分别提供了Apache VC9, Apache X64, PHP X64。
</p>





<ul class="org-ul">
<li>Apache Haus: <a href="http://www.apachehaus.com/"><a href="http://www.apachehaus.com/">http://www.apachehaus.com/</a></a>
</li>
<li>Apache Lounge: <a href="http://www.apachelounge.com/"><a href="http://www.apachelounge.com/">http://www.apachelounge.com/</a></a>
</li>
<li>Aninda's Blog: <a href="http://www.anindya.com/"><a href="http://www.anindya.com/">http://www.anindya.com/</a></a>
</li>
</ul>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
